### Turtle Graphics

In [ ]:
# Design Spiral star
import turtle as t
a1 = t.Turtle()
a1.pencolor('blue')
for i in range (40):
    a1.forward( i*10 )
    a1.left(144)
t.done()

In [ ]:
# Design Spiral square
import turtle as t
a1 = t.Turtle()
a1.pencolor('blue')
for i in range (200):
    a1.forward(i)
    a1.left(91)
a1.done()

In [ ]:
# Design Hexagon
from turtle import *
pencolor('blue')
colors = ('blue','green','red','purple','yellow','orange')
for i in range(360):
          pencolor(color[i%6])
    width(i/100 + 1)
    forward(i)
    left(59)

In [ ]:
## Design Rectangle
## Generate Circle

In [2]:
## Generate Circle
# Design Circle
from turtle import *
pensize(20)
pencolor('black')
fillcolor('green')
begin_fill()
circle(100)
end_fill()

In [1]:
# Design Tangent Circle
from turtle import *
pensize(3)
pencolor('purple')
for i in range (15):
    circle(10*i)

In [ ]:
# Design Spiral Circle
from turtle import *
pensize(3)
pencolor('blue')
for i in range(100):
    circle(10+i,45)

In [ ]:
# Design Circle
from turtle import *
pensize(3)
colors = ('blue','green','red','yellow','orange','black')
for i in range(30):
    pencolor(colors[i%6])
    circle(10*i)
    up()
    sety((10*i)*(-1))
    down()

In [ ]:
# Design Olympic logo
from turtle import *
pensize(6) # set the pensize to 6 pixels
r1 = ["blue","black","red"]
for i in range(3):
    penup()
    pencolor(r1[i%3])
    goto(i*100,0)
    pendown()
    circle(45)
r2 = ["","yellow","","green"]
for i in range(1,4,2):
    penup()
    pencolor(r2[i])
    goto(i*55,-55)
    pendown()
    circle(50)

In [ ]:
# Design Audi logo
from turtle import *
pencolor('black')
pensize(6)
for i in range(4):
    penup()
    goto(i*70,0)
    pendown()
    circle(50)

### Idiomatic Python
- Transformation code into Beautiful,idiomatic python
- Replace Traditional index manipulation with python code looping idioms

In [1]:
# Looping over a range of number
for i in[0,1,2,3,4,5]:
    print(i ** 2,end=' ')
print()
# Pythonic-way
for i in range(6):
    print(i ** 2,end=' ')

0 1 4 9 16 25
0 1 4 9 16 25

In [3]:
# Looping over the coolection(List)
li = [1,2,3,4,5]
for i in range (len(li)):
    print(li[i],end=' ')
print()
# Pythinic way
for i in li:
    print(i,end=' ')

1 2 3 4 5
1 2 3 4 5

In [4]:
# Lopping from bckward
li = [1,2,3,4,5]
for i in range(len(li)-1,-1,-1):
    print(li[i],end=' ')
print()
#Pythonic-way
for i in reversed(li):
    print(i,end=' ')

5 4 3 2 1
5 4 3 2 1

In [7]:
# Looping over the collection with index
li = [1,2,3,4,5]
for i in range (len(li)):
    print(i,'-->',li[i])
print()
# Pythonic-way
for i,a in enumerate(li):
    print(i,'-->',a)

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

In [8]:
# Looping over two collections
li = [1,2,3,4,5]
a = [1,2,3,4,5,6,8]
n = min(len(li),len(a))
for i in range (n):
    print(li[i],' ',a[i])
print()
# Pythonic-way
for i,a in zip (li,a):
    print(i,' ',a)

1   1
2   2
3   3
4   4
5   5

1   1
2   2
3   3
4   4
5   5

In [10]:
# Looping in sorted order
# Pythonic-way
li = [12,5,23,6,1,9]
for i in sorted(li):
    print(i,end=' ')
print()
for i in sorted(li,reverse=True):
    print(i,end=' ')

1 5 6 9 12 23
23 12 9 6 5 1

In [1]:
# Dictionary
d = {'Name':'Sankar','EmailID':'bhavanisankar@gmail.com','Address':'Vizag'}
for k in d:
    print(k,end=' ')
print()

Name EmailID Address

In [7]:
for k in d.keys():
    if k.startswith('g'):
        del d[k]

In [8]:
print(d)

{'Name': 'Sankar', 'EmailID': 'bhavanisankar@gmail.com'}

In [9]:
for k in d.values():
    print(k,end=' ')

Sankar bhavanisankar@gmail.com

### List Comprehensions

In [12]:
# Traditional Apporach
li = []
for i in range(10):
    a = i ** 2
    li.append(a)
    
print(sum(li))
print()
# pythonic-way
print(sum(i**2 for i in range(10)))

285

285

In [13]:
li = []
for i in range(10):
    li.append(i ** 2)
li

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [14]:
com_list = [i ** 2 for i in range(10)]
com_list

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [15]:
for i in li:
    if i % 2 ==0:
        print(i,end=' ')

0 4 16 36 64

In [17]:
com_list = [i ** 2 for i in range(10) if i % 2 == 0]
com_list

[0, 4, 16, 36, 64]

### Lambda Functions
- Anonymous function means that a function is without a name
- Any lambda function on python will be defined with lambda
- Syntax lambda arg:expression

In [1]:
def square(n):
    return n*n
square(10)

100

In [2]:
a = lambda x: x * x
print(a(10))

100

In [3]:
def filterList(li):
    a = []
    for i in li:
        if i  % 2 == 0:
            a.append(i)
    return a
li = [1,2,3,4,5,6,7,8]
filterList(li)

[2, 4, 6, 8]

In [4]:
li = [1,2,3,4,5,6,7,8]
lam_li = list(filter(lambda x : (x%2 == 0),li))
print(lam_li)

[2, 4, 6, 8]

### Lambda with map()
- map() function in python takes in a function and list as argument.

In [6]:
# Functional apporach
def squareList(li):
    a = []
    for i in li:
        a.append(i*2)
    return a
li = [1,2,3,4,5,6,7,8]
squareList(li)

[2, 4, 6, 8, 10, 12, 14, 16]

In [7]:
# Lambda with map()
li = [1,2,3,4,5,6,7,8]
map_list = list(map(lambda x : x*2,li))
print(map_list)

[2, 4, 6, 8, 10, 12, 14, 16]

### Lambda with reduce()

In [8]:
# Functional Apporach
def sumList(li):
    s = 0
    for i in li:
        s += i
    return s
li = [1,2,3,4,5,6,7,8]
sumList(li)

36

In [10]:
# Lambda with Reduce
from functools import reduce
li = [1,2,3,4,5,6,7,8]
s = reduce((lambda x,y:x+y),li)
print(s)

36

### Standard Package
### Pandas,Numpy,Matplotlib

### Pandas

### Use cases
- Data cleaning
- Data Transformation
- Data Analysis
### Notations
- Series
  - a Series is a one-dimensional object that can hold int,float and string
- DataFrames is a two dimensional object

In [8]:
import pandas as pd
internal1 = {'s1':32,'s2':45,'s3':37}
internal2 = {'s1':45,'s2':35,'s3':25}
internal1 = pd.Series(internal1)
internal2 = pd.Series(internal2)
print(internal1)
print(internal2)
print(type(internal2))

s1    32
s2    45
s3    37
dtype: int64
s1    45
s2    35
s3    25
dtype: int64
<class 'pandas.core.series.Series'>

In [11]:
final = {'Internal1':internal1,'Internal2':internal2}
final = pd.DataFrame(final)
print(final)
print(type(final))

    Internal1  Internal2
s1         32         45
s2         45         35
s3         37         25
<class 'pandas.core.frame.DataFrame'>

In [12]:
final.columns  # Returns the names of columns

Index(['Internal1', 'Internal2'], dtype='object')

In [13]:
final.values # Returns all row values in 2 Dimensional array

array([[32, 45],
       [45, 35],
       [37, 25]], dtype=int64)

In [14]:
final.values[1]  # 1 represent the row index

array([45, 35], dtype=int64)

In [15]:
final.values[2][0] = 350  # Update the DataFrame values

In [16]:
final.values

array([[ 32,  45],
       [ 45,  35],
       [350,  25]], dtype=int64)

In [17]:
for row in final.values:
    print('Internal1 - ',row[0],'Internal2 - ',row[1])

Internal1 -  32 Internal2 -  45
Internal1 -  45 Internal2 -  35
Internal1 -  350 Internal2 -  25

In [18]:
final.loc['s4'] = [20,25]
final

    Internal1  Internal2
s1         32         45
s2         45         35
s3        350         25
s4         20         25

In [21]:
final.values[2] = [55,66]
final

    Internal1  Internal2
s1         32         45
s2         45         35
s3         55         66
s4         20         25

In [22]:
pwd

'C:\\Users\\cse319\\Desktop\\Problem solving and programming'

In [36]:
filepath = 'DataFiles/Income.csv'
def readCsvData(filepath):
    return pd.read_csv(filepath)
readCsvData(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [37]:
df = readCsvData(filepath)
print(df)

       GEOID       State   2005   2006   2007   2008   2009   2010   2011  \
0  04000US01     Alabama  37150  37952  42212  44476  39980  40933  42590
1  04000US02      Alaska  55891  56418  62993  63989  61604  57848  57431
2  04000US04     Arizona  45245  46657  62993  46914  45739  46896  48621
3  04000US05    Arkansas  36658  37057  40795  39586  36538  38587  41302
4  04000US06  California  51755  55319  55734  57014  56134  54283  53367

    2012   2013
0  43464  41381
1  63648  61137
2  47044  50602
3  39018  39919
4  57020  57528

In [38]:
# Extract income of all bstates in year 2013
# Alabama :41381
# ......
for row in df.values:
    print(row[1], ' : ',row[-1])

Alabama  :  41381
Alaska  :  61137
Arizona  :  50602
Arkansas  :  39919
California  :  57528

In [39]:
print(df.values)

[['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
  41381]
 ['04000US02' 'Alaska' 55891 56418 62993 63989 61604 57848 57431 63648
  61137]
 ['04000US04' 'Arizona' 45245 46657 62993 46914 45739 46896 48621 47044
  50602]
 ['04000US05' 'Arkansas' 36658 37057 40795 39586 36538 38587 41302 39018
  39919]
 ['04000US06' 'California' 51755 55319 55734 57014 56134 54283 53367
  57020 57528]]

In [48]:
# Average income of california
def avgofState():
    s = 0
    for i in range(2,11):
        s += df.values[4][i]
    return s // len(df.values[4][2:])
avgofState()

55350

In [64]:
# Function which only display the column names in the list
# GEOID state 2005 2006 2007 2008 n2009 2010 2011 2012 2013
def printDataFrameColumns(df):
    li = []
    columns = df.columns:
    for i in columns:
        li.append(i)
        return li
printDataFrameColumns(df)

SyntaxError: invalid syntax (<ipython-input-64-381b43e30cf4>, line 5)

In [50]:
filepath = 'DataFiles/RegularSeasonCompactResults.csv'
def readCsvData(filepath):
    return pd.read_csv(filepath)
df=readCsvData(filepath)
print(df)

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
5         1985      25   1218      79   1337      78    H      0
6         1985      25   1228      64   1226      44    N      0
7         1985      25   1242      58   1268      56    N      0
8         1985      25   1260      98   1133      80    H      0
9         1985      25   1305      97   1424      89    H      0
10        1985      25   1307     103   1288      71    H      0
11        1985      25   1344      75   1438      71    N      0
12        1985      25   1374      91   1411      72    H      0
13        1985      25   1412      70   1397      65    N      0
14        1985      25   1417      87   1225      58    H      0
15        1985      26   1116      65   1368      62    H      0
16        1985      26   1120      92   1391      50    H      0
17        1985      26   1135      65   1306      60    A      0
18        1985      26   1143      58   1388      53    H      0
19        1985      26   1153      50   1184      48    H      0
20        1985      26   1165      47   1159      40    A      0
21        1985      26   1171      55   1216      52    H      0
22        1985      26   1173      76   1134      56    H      0
23        1985      26   1177      59   1296      58    H      0
24        1985      26   1193      79   1265      76    A      0
25        1985      26   1196     106   1416      55    H      0
26        1985      26   1206      95   1137      77    H      0
27        1985      26   1210      79   1149      66    H      0
28        1985      26   1211      64   1102      59    A      0
29        1985      26   1234      76   1114      47    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145259    2016     130   1452      69   1328      67    N      0
145260    2016     131   1114      72   1418      65    N      0
145261    2016     131   1138      64   1103      61    N      0
145262    2016     131   1163      77   1396      62    N      0
145263    2016     131   1167      57   1308      54    N      0
145264    2016     131   1201      68   1361      63    N      0
145265    2016     131   1214      81   1354      69    N      0
145266    2016     131   1218      64   1253      60    N      0
145267    2016     131   1242      81   1452      71    N      0
145268    2016     131   1246      93   1208      80    N      0
145269    2016     131   1272      74   1408      54    N      0
145270    2016     131   1277      64   1268      61    N      0
145271    2016     131   1292      55   1330      53    N      0
145272    2016     131   1314      61   1438      57    N      0
145273    2016     131   1332      88   1428      57    N      0
145274    2016     131   1345      76   1276      59    N      0
145275    2016     131   1371      69   1437      67    N      0
145276    2016     131   1372      82   1394      60    N      0
145277    2016     131   1380      54   1238      53    N      0
145278    2016     131   1386      82   1173      79    N      0
145279    2016     131   1392      80   1436      74    H      0
145280    2016     131   1401      71   1261      38    N      0
145281    2016     131   1419      82   1426      71    N      0
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

[145289 rows x 8 columns]

In [52]:
df.shape

(145289, 8)

In [54]:
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [55]:
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [56]:
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [57]:
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [58]:
df.max() # All the column max() value

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [59]:
df['Lteam'].max() # All the columns max( )values

1464

In [62]:
df['Lteam'].min()

1101

In [63]:
df['Lteam'].sum()

186386037

In [74]:
df['Season'].count()

145289

In [66]:
df.loc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0

In [67]:
df.iloc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0

In [70]:
df.sort_values('Lscore').head()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027    2008      66   1203      49   1387      20    H      0
49310     1997      66   1157      61   1204      21    H      0
89021     2006      44   1284      41   1343      21    A      0
85042     2005      66   1131      73   1216      22    H      0
103660    2009      26   1326      59   1359      22    H      0

In [71]:
df.sort_values('Lscore').tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
77873    2003     110   1383     142   1254     140    H      2
24970    1991      68   1258     186   1109     140    H      0
22074    1990      96   1261     148   1258     141    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0

In [73]:
# Filter the Rows based on the condition
df[df['Wscore'] > 170]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0

In [76]:
df[(df['Wscore'] > 170) & (df['Daynum']>60)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
24970    1991      68   1258     186   1109     140    H      0